app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Attaching pictures test"], ["picture", "B1C3PFO.jpg"], ["user_id", 101], ["created_at", "2016-09-19 18:15:02.373120"], ["updated_at", "2016-09-19 18:15:02.373120"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save